app/controllers/lobby_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE (upper(code) = 'QUOPH')  ORDER BY "rooms"."id" ASC LIMIT 1
---
  def join
    @room = Room.where('upper(code) = ?', params[:code].upcase).first