app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("name", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "I'm the best"], ["code", "hfszo"], ["created_at", "2016-03-01 03:43:50.876736"], ["updated_at", "2016-03-01 03:43:50.876736"]]
---
  def create
    @room = Room.new(room_params)
    room_code = (0...5).map do ('A'..'Z').to_a[rand(26)] end.join
    @room.code = room_code
    if @room.save